
&НаКлиенте
Процедура ЧекККМОткрытие(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
		СтандартнаяОбработка=Истина;
		ПараметрыФормы = Новый Структура("Ключ", Объект.ЧекККМ);
		//ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаДокумента");
		Если Объект.МиниФорма Тогда
			ОткрытьФорму("ВнешняяОбработка.ЧекККМРедактирование.Форма.ФормаМини", ПараметрыФормы);
		Иначе
			ОткрытьФорму("ВнешняяОбработка.ЧекККМРедактирование.Форма.ФормаДокумента", ПараметрыФормы);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
