
&НаКлиенте
Процедура ЧекККМОткрытие(Элемент, СтандартнаяОбработка)
	//Если ЕстьПрово() И ЗначениеЗаполнено(Элементы.ЗаказыКлиентов.ТекущиеДанные.ЧекККМ) Тогда
	Если ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
		СтандартнаяОбработка=Ложь;
		ПараметрыФормы = Новый Структура("Ключ", Объект.ЧекККМ);
		//ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаДокумента", ПараметрыФормы);
		Если Объект.МиниФорма Тогда
			ОткрытьФорму("ВнешняяОбработка.ЧекККМРедактирование.Форма.ФормаМини", ПараметрыФормы);
		Иначе
			ОткрытьФорму("ВнешняяОбработка.ЧекККМРедактирование.Форма.ФормаДокумента", ПараметрыФормы);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
